
let one= document.getElementById('showhere')

function changeSurah (){
    one.innerHTML= ""
   let surah= ['اسماءالسورالقرآن الکریم','الفاتحہ','البقرہ',' آل عمران','النساء','المائدہ','الأنعام','الأعراف','الأنفال',
   'التوبہ','یونس','ہود','یوسف','مریم','الرعد','ابراہیم','الحجر','النحل',
   'الإسراء','الکہف','طہ','الانبیاء','الحج','المؤمنون','النور','الفرقان',
   'الشعراء','النمل','القصص','العنکبوت','الروم','لقمان','السجدہ','الأحزاب',
   'سبا','فاطر','یٰس','الصافات','ص','الزمر','غافر','فصلت','الشوریٰ','الزخرف',
   'الدخان','الجاثیہ','الاحقاف','محمد','الفتح','الحجرات','ق','الذاریات',
   'الطور','النجم','القمر','الرحمن','الواقعہ','الحدید','المجادلہ','الحشر',
   'الممتحنہ','الصف','الجمعہ','المنافقون','التغابن','الطلاق','التحریم','الملک',
   'القلم','الحاقہ','المعارج','نوح','الجن','المزمل','المدثر','القیامہ',
   'الانسان','المرسلات','النبا','النازعات','عبس','التکویر','الانفطار','المطففین',
   'الانشقاق','البروج','الطارق','الأعلى','الغاشیہ','الفجر','البلد',
   'الشمس','اللیل','الضحیٰ','الانشراح','التین','العلق','القدر','البینہ','الزلزال',
   'العادیات','القارعہ','التکاثر','العصر','الہمزہ','الفیل','قریش','الماعون',
   'الکوثر','الکافرون','النصر','اللھب','الإخلاص','الفلق','الناس']
    let v = document.getElementById('input').value;
    for (let s=0; s<=surah.length; s++){
        one.innerHTML= surah[v]
  }
}